Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་བསོད་སྙོམས་ལ་སྤྱད་དེ། །འདུག་ནས་རང་ཉིད་སེམས་པར་བྱེད། །
en: “Having eaten his supply of alms, He will sit and reflect as follows:

source: དུས་རིང་བདག་གིས་སངས་རྒྱས་ལ། །བདག་གིས་ཀྱང་ནི་དེ་ཕྱག་བྱས། །
en: ‘I have spent a lot of time Paying homage to the Buddha, the great sage.

source: རང་བྱུང་གྱུར་པ་མི་ཡི་མཆོག །བདག་གིས་ད་ལྟར་དེ་བལྟ་བྱ། །
en: Now I would like to visit That supreme, spontaneously arisen person. {53.113}

source: ཤཱཀྱའི་རིགས་སྐྱེས་ཐུབ་པ་མཆོག །བཅོམ་ལྡན་དེ་ནི་ག་ལ་བཞུགས། །
en: “ ‘Where is the Blessed One staying, This most virtuous sage of the Śākyas?’

source: བྲམ་ཟེའི་རྒྱལ་པོ་འོད་སྲུང་ཆེ། །དེར་ནི་ཡང་དག་དགོངས་པར་གྱུར། །ཐུབ་པའི་ཐུབ་པ་ཁོ་ན་ནི། །སེམས་ཀྱིས་དེ་ལྟར་བསམ་པར་གྱུར། །
en: Mahākāśyapa, the king of brahmins, will thus focus his mind On the Blessed One while remaining at his place. {53.114} “He will perceive the sage of sages With his mind alone.

source: ལྷ་ཡི་མིག་གིས་འཇིག་རྟེན་ལ། །འཇིག་རྟེན་མ་ལུས་ལྟ་བར་བྱེད། །
en: He will also see, with the divine eye, The world [where he lives] and all the [other] worlds: {53.115}

source: འོག་མིན་དེ་བཞིན་འཇིག་རྟེན་མཐའ། །སྲིད་རྩེའི་འཇིག་རྟེན་ཁམས་ཀྱི་བར། །འཇིག་རྟེན་མ་ལུས་ཐམས་ཅད་དང་། །སྟོང་ཆེན་སྲེད་པ་ལས་བྱུང་བ། །
en: “ Akaniṣṭha and other such worlds With their luminous world spheres, And all the worlds that are named after all their beings And are part of great thousandfold worlds within still greater units. {53.116}

source: ཉན་ཐོས་སྤྱོད་ཡུལ་ཇི་ཙམ་པར། །ལྷ་ཡི་མིག་གིས་བལྟ་བྱས་ནམྱ་ངན་འདས་གཟིམས་ཞི་བ་དང་། །བསིལ་བར་གྱུར་ཅིང་ནད་མེད་པ། །རྫུ་འཕྲུལ་ཆེན་པོ་ལྷ་ཚོགས་ཀྱིས། །
en: “Looking with his divine eye As far as the śrāvakas can, He will see the Teacher passed into nirvāṇa, Peaceful, emancipated, and immaterial, {53.117}

source: ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ་དང་། །མི་དང་མི་ཡི་བདག་པོ་དང་། །ལྷ་མིན་གནོད་སྦྱིན་སྲིན་པོ་དང་། །འབྱུང་པོའི་ཚོགས་ནི་ཐམས་ཅད་དང་། །བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་ཆེ། །
en: “Surrounded on all sides By hosts of very powerful gods As well as human kings, Asuras, yakṣa s, rākṣasas, And all the hosts of spirits, And also by the bodhisattvas with great powers, {53.118}

source: གྲགས་ཆེན་ཉན་ཐོས་ཆེན་པོ་ཡང་། །ཤེས་རབ་གཙོར་ནི་གྱུར་པ་དང་། །འདོད་ཆགས་བཅས་དང་འདོད་ཆགས་བྲལ། །
en: “Śrāvakas of great renown Who excel in wisdom, And noble celestials and humans Both with and without passion. {53.119}

source: ལྷ་དང་བཅས་པའི་མི་རྣམས་ཀྱིས། །དཔའ་བོ་ཤིང་ལ་བཏེག་པ་ནི། །སངས་རྒྱས་ཉི་མའི་རིགས་ལས་བྱུང་། །དེ་བཞིན་ལྷ་ཡི་ལྷར་གྱུར་གཙོ། །ཐུབ་པ་དམ་པའི་མངའ་བདག་ནི། །ས་བདག་གླིང་ལ་གནས་རྣམས་ཀྱིས། །
en: “He will see the valiant one upon the funeral pyre— The Buddha, a relative of the sun, The god of gods, The supreme and most virtuous lord of sages, {53.120}

source: ཀུན་ནས་ཡོངས་སུ་བསྐོར་གྱུར་ནས། །མི་ཡི་དབང་མཆོག་གྱད་དག་གིས། །ལག་ན་རྩྭ་སྒྲོན་ཡང་དག་ཐོགས། །དེ་དག་མེ་སྦར་མི་ནུས་པར། །ལྷ་རྣམས་ཀྱིས་ནི་བཟློག་འགྱུར་ཞེས། །དགེ་སློང་མ་འགགས་པ་ཡང་ནི། །བརྟུལ་ཞུགས་ཅན་གྱིས་དེ་སྐད་སྨྲས། །
en: “Surrounded on all sides By the earthly kings, Including the mighty Mallas, Holding in their hands lamps, fragrances, and grass torches. {53.121} “As explained by the monk Aniruddha, Who keeps his observances, The kings, held back by the gods, Will be unable to light the pyre. {53.122}

source: འཆི་མས་བརྣངས་ཤིང་སྨྲེ་སྔགས་འདོན། །ས་རྣམས་སྒྲ་ནི་ཆེན་པོས་གང་། །ཧ་ཧ་ཞེས་བྱའི་སྒྲ་ཉིད་དང་། །རྔ་བོ་ཆེ་ཡི་སྒྲ་ཡང་ཐོས། །
en: “The earth goddess will wail loudly, Her voice choked by tears. There will be terrible exclamations of ‘alas, alas!’ And the sound of thunder will resound. {53.123}

source: ལྷ་དང་དྲང་སྲོང་ཚོགས་ཀྱིས་ཁྱབ། །ལྷ་ཡི་བུ་མོའི་ཚོགས་ཀྱིས་བསྟོད། །
en: “The grove will be divinely filled with hosts of ṛṣis And apsarases singing praises;

source: གྲུབ་པ་རིག་འཛིན་ཀླུ་དང་ནི། །མི་འམ་ཅི་ཀླུ་རྒྱ་ཆེ་བ། །
en: It will resound with songs of siddha s and vidyādharīs, And with the singing of kinnaras. {53.124}

source: སྙན་པའི་སྒྲ་ནི་སྒྲོགས་པར་བྱེད། །བྱ་ཡི་སྐད་ནི་དགེ་བ་དང་། །ཡིད་འོང་སྣ་ཚོགས་རོལ་མོ་དང་། །ལྷ་དང་མི་ཡིས་རྗེད་པ་དང་། །
en: “There will be the sweet cooing And beautiful warbling of birds And lovely sounds of various instruments Played by celestials and humans. {53.125}

source: ལྷ་ཡི་བུ་མོའི་ཚོགས་ཀྱིས་གང་། །གྲུབ་པ་རིག་འཛིན་དག་དང་ལྡན། །དེ་ཚེ་སཱ་ལའི་ནགས་དག་ཏུ། །རྣལ་འབྱོར་དག་གིས་ཀུན་ཏུ་ཁྱབ། །
en: “The Sāla Grove will be Filled with the songs of apsarases, Graced with the presence of siddha s and vidyādharas, And full of yogins all over. {53.126}

source: ཐུབ་མཆོག་གཟིམས་མལ་དམ་པ་ནི། །ཀུན་ནས་ཡོངས་སུ་བསྐོར་བར་མཐོང་། །
en: “The fine bed of the bull among sages Will [thus] be surrounded on all sides,

source: རྫུ་འཕྲུལ་ཆེན་པོ་མྱ་ངན་བྲལ། །དེ་ནས་དབུགས་འབྱིན་མྱ་ངན་བཅས། །
en: And above it, Kāśyapa will sigh with grief, Even though he is normally free from sorrow. {53.127}

source: དེ་ཚེ་བྲམ་ཟེ་འོད་སྲུང་ནི། །མཆི་མའི་ཐིགས་པའང་རབ་ཏུ་འདོན། །ང་ཡི་ཉན་ཐོས་མཆོག་གྱུར་པ། །དེ་ཚེ་ས་ཡི་སྟེང་དུ་འགྱེལ། །ཚིག་ཀྱང་མྱུར་དུ་བརྗོད་པ་ནི། །
en: “Shedding tears, The monk Kāśyapa, Foremost among my śrāvaka-disciples, Will then collapse on the ground {53.128} “And promptly cry out,

source: ཀྱེ་མའོ་དཀའ་བ་རབ་ཏུ་བྱུང་། །གང་དུ་སངས་རྒྱས་ཞེས་བྱ་བ། །ཟག་མེད་མྱ་ངན་འདས་གྱུར་ཏམ། །
en: ‘Alas! A difficult time has begun Where the Buddha, free from karmic traits, Has now passed into final nirvāṇa. {53.129}

source: མི་རྟག་སྡུག་བསྔལ་སྟོང་པ་ཞེས། །དེ་ཉིད་ཀྱིས་ནི་འདིར་གསུངས་པ། །སྐྱེ་བ་གཞན་གྱི་རྗེས་འགྲོ་བ། །བདག་གིས་སྟོན་པའི་སྐུ་མི་མཐོང་། །
en: “ ‘He himself taught, in this world, About impermanence, suffering, and emptiness. I see nothing permanent; Everything must undergo successive rebirth.’ {53.130}

source: དེ་ནས་ལངས་ནས་མྱུར་དུ་ནི། །མ་ག་དྷཱ་ཡི་རྒྱལ་པོར་སོང་། །སྡུག་བསྔལ་ཉམ་ཐག་མ་སྐྱེས་དགྲ། །ཕ་ཡི་མྱ་ངན་གྱིས་ནོན་པའི། །
en: “Kāśyapa will then quickly get up And go to the king of the Magadhans, Ajātaśatru, who will be in a state of anguish, Overwhelmed by grief for his father. {53.131}

source: དེ་ཚེ་དེ་ཡི་ཕུག་འོངས་ནས། །མི་ཡི་བདག་པོ་དེ་ལ་སྨྲས། །
en: “Having arrived in his house, Kāśyapa will say to the king,

source: རྐང་གཉིས་དམ་པ་རྫོགས་སངས་རྒྱས། །རྒྱལ་པོ་ཆེན་པོ་མྱ་ངན་འདས། །
en: ‘O great king! The perfect Buddha, Supreme among two-legged beings, has passed into nirvāṇa. {53.132}

source: བཞོན་པ་མྱུར་དུ་སྦྱོར་མཛོད་དང་། །ང་ནི་སྟོན་པའི་དྲུང་འགྲོ་བ། །
en: “ ‘Quickly prepare a carriage, And let’s go to the Teacher’s side!

source: སཱ་ལར་གཟིམས་མལ་བཞུགས་པ་ནི། །ནད་མེད་སེམས་དང་རྣམ་པར་བྲལ། །
en: He is lying on a bed on the ground, His mind free from feverish agitation,

source: བསྟན་པ་ཐམས་ཅད་ལས་འདས་ཤིང་། །སྐུ་ཡི་དམ་པ་ལོངས་སྤྱོད་རྫོགས། །
en: Beyond any enmity or fear, Abiding in the supreme body of bliss.’ {53.133}

source: མ་རུངས་དེ་ཚིག་ཐོས་ནས་ནི། །རྒྱལ་པོ་དེ་ཡང་སྡུག་བསྔལ་ཞིང་། །
en: “Hearing the painful news, The king will become even more distressed.

source: ཉམ་ཐག་སྨྲེ་བར་གྱུར་པ་ཡི། །དེ་ཚེ་ཚིག་ནི་རྒྱལ་པོ་འདོན། །
en: Expressing his inner lament, He will say the following words: {53.134}

source: སྟོན་པ་དང་ནི་ཕ་དག་དང་། །གཉི་ག་ལས་ཀྱང་བདག་ཉམས་གྱུར། །
en: “ ‘I have lost both My Teacher and my father.

source: གཉེན་རྣམས་ཀུན་གྱིས་སྤངས་པ་སྟེ། །དེ་ཚེ་སྐྱེ་བོ་ཡིད་ཆེས་མེད། །
en: I have been abandoned by all my relatives, And the people, likewise, do not trust me.

source: དམྱལ་བ་མི་བཟད་ལྟུང་འགྱུར་ན། །བདག་ནི་སུ་ཡི་སྐྱབས་ལ་བརྟེན། །
en: When I fall into the terrible hell, In whom will I find my refuge? {53.135}

source: ཉན་ཐོས་སྟོན་པའི་མཆོག་གྱུར་པ། །དཔའ་བོ་ཆེན་པོ་སྐྱབས་མཛོད་ཅིག །
en: “ ‘Protect me, O great hero, Foremost śrāvaka of the Teacher!

source: ཉན་ཐོས་ཆེན་པོ་གཟི་བརྗིད་ཆེ། །བདག་གི་འཚོ་བ་འདི་ན་མེད། །
en: Mahākāśyapa of great splendor! There is no life for me in this world.’ {53.136}

source: མ་ག་དྷཱ་ཡི་མི་ཡི་བདག །དེ་ནས་དེ་སྐད་སྨྲས་པ་དང་། །ཉན་ཐོས་མཆོག་གི་རྐང་གཉིས་ལ། །དེ་ཡི་མོད་ལ་སྤྱི་བོས་གཏུགས། །
en: “Having spoken this, the king, The chief ruler of the Magadhans, Will suddenly collapse on the ground At the feet of the distinguished śrāvaka.

source: དེར་ནི་སེམས་མེད་བརྒྱལ་གྱུར་པ། །དེ་ཡི་ཚེ་ན་གཞོན་ནུ་ནི། །
en: He will lie on the ground, stripped of his will, Motionless and unconscious. {53.137}

source: རྫུ་འཕྲུལ་ཆེན་པོ་འཇམ་པའི་དབྱངས། །དབུགས་འབྱིན་པ་ནི་བྱེད་པར་འགྱུར། །
en: “At that time, you, Mañjughoṣa, Divine youth of great magical power,

source: སེམས་ཅན་རྗེས་སུ་གཟུང་འདོད་པས། །འཇིག་རྟེན་ཀུན་ཏུ་རྒྱུ་བར་གྱིས། །
en: Will visit places around the world With the wish to benefit beings. {53.138}

source: གང་ཚེ་སཱ་ལའི་ནགས་སུ་ནི། །ང་ལུས་ཤིང་གི་སྟེང་བཞག་པ། །
en: “When my body is placed on the pyre At its location in the grove,

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་བསྐོར་ནསདེ་ཚེ་ཁྱོད་ནི་འདུག་པར་འགྱུར། །
en: You will also sit there, Surrounded by a host of bodhisattvas. {53.139}

source: གང་ཕྱིར་ང་ལུས་མཆོད་པའི་ཕྱིར། །ས་སྟེང་འདིར་ནི་ཁྱོད་ཀྱིས་བྱས། །འཇིག་རྟེན་ཀུན་ཏུ་བལྟས་ནས་ནི། །སུ་ཞིག་སྡུག་བསྔལ་གང་ལས་དྲང་། །
en: “Having prepared my body To be worshiped there, on the earth, You will look at the beings around and reflect, ‘Which of them are suffering?

source: གཞོན་ནུ་ཟབ་པའི་བློ་ལྡན་པ། །དེ་ལྟར་ས་ལ་འགྱེལ་བར་གྱུར། །འཇམ་དཔལ་གྱིས་ནི་དེ་ཡི་ཚེ། །ས་བདག་དེ་ནི་སྡུག་བསྔལ་བ། །
en: Whom can I save?’ {53.140} “When I lie there on the ground, there will be you, Divine youth with the profound understanding of the truth. You, Mañjuśrī, will be able to enthrall The greatly suffering King Ajātaśatru. {53.141}

source: དེར་གནས་པ་ལ་ཁྱོད་ཀྱིས་ནི། །ཁྱོད་ཉིད་ཀྱིས་ནི་དེ་འདུལ་འགྱུར། །
en: “Even though [Mahākāśyapa] will be there, It is you alone who will be able to guide the king,

source: བྱང་ཆུབ་སེམས་དཔས་རྟོགས་འགྱུར་གྱིས། །ལྷ་དང་དྲང་སྲོང་རྣམས་དང་ནི། །ཉན་ཐོས་རང་རྒྱལ་གཞན་དག་དང་། །རྫུ་འཕྲུལ་ཆེན་པོས་མི་ནུས་སོ། །
en: Because what is possible for the bodhisattvas Is not possible even for the magically endowed beings, Such as deities, ṛṣis, and so forth Or the pratyeka­buddhas and noble śrāvakas. {53.142}

source: འཇམ་པའི་དབྱངས་ཀྱིས་མི་བདག་ནི། །རྨི་ལམ་གནས་པ་བཞིན་དུ་མཐོང་། །
en: “The king, lying there, Will see you, Mañjughoṣa, as if in a dream.

source: ཁྱོད་ཀྱི་རྫུ་འཕྲུལ་བྱིན་རླབས་ཀྱིས། །རྒྱལ་པོ་མྱ་ངན་གྱིས་བརྒྱལ་དེས། །
en: Given by you a special power, The king, fallen into a swoon from his grief, {53.143}

source: དེ་ཚེ་དེ་ནི་རྨི་ལམ་དུ། །མངོན་སུམ་བྱིས་པ་ལྟ་བུར་མཐོང་། །
en: “Will see in a dream The clear form of a young boy—

source: རྫུ་འཕྲུལ་ཆེན་པོ་འཇམ་པའི་དབྱངས། །གཞོན་ནུ་བདག་ཉིད་སྣ་ཚོགས་པ། །
en: The all-pervading, divine youth, Mañjughoṣa of great power. {53.144}

source: དེ་བཞིན་ཆོས་ནི་རྣམ་པར་འཕྲུལ། །བྱང་ཆུབ་སེམས་དཔའ་བྱིས་པའི་གཟུགས། །སྣ་ཚོགས་རྫུ་འཕྲུལ་བསམ་མི་ཁྱབ། །འཇམ་དཔལ་གྱིས་བསྟན་སེམས་དང་བྱས། །
en: “Through you grace, Mañjuśrī, he will see you, A bodhisattva with the form of a child Who is the magical manifestation of the Dharma, With manifold, inconceivable power. {53.145}

source: རྒྱལ་པོ་མནར་མེད་འགྲོ་བ་ལས། །མྱུར་དུ་དེ་ལས་ལྡང་བར་འགྱུར། །རྣམ་པ་སྣ་ཚོགས་ལས་དང་ནི། །ངན་སོང་མཐོ་རིས་བཟང་པོ་དང་། །
en: “The king will fall into the Avīci hell But then will rapidly rise up Through the different states of being, His lower rebirths having been auspiciously purified,

source: འགྲོ་བ་བདག་ཉིད་ཆེ་ཡོན་ཏན། །ཉན་ཐོས་ཐམས་ཅད་རྣམ་སྤངས་པ། །
en: And will also experience the merits of higher births That are shunned by all the śrāvakas. {53.146}

source: དེ་ནས་རྒྱ་ཆེར་བྱས་པ་ནི། །མདོ་སྡེ་འགྱོད་པ་སེལ་བ་སྟེ། །རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཡི་ནི། །ཤིན་ཏུ་རྒྱ་ཆེར་གསལ་བའོ། །
en: “When he has thus completely purified The last vestiges of his crimes, King Ajātaśatru will enjoy Immense pleasures. {53.147}

source: རྒྱ་ཆེ་དོན་གྱིས་བརྒྱན་པ་ཡི། །མདོར་བསྡུས་ནས་ནི་འདི་གསུངས་སོ། །
en: “This teaching, presented here only briefly, Is nevertheless adorned with a wide range of distinctive meanings.

source: དང་པོ་བར་མ་ཐ་མ་ཡི། །སངས་རྒྱས་ཀུན་གྱི་གསུང་དག་ནི། །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །ཆོ་ག་རྒྱ་ཆེར་གསུངས་པ་ཡིན། །
en: It represents the speech of all the buddhas In the beginning, in the middle, and at the end. This extensive manual has thus been taught In order to benefit all beings. {53.148}

source: དེ་ནས་འཇམ་དཔལ་དུས་ཀུན་ཏུ། །གཞོན་ནུ་ཁྱོད་ནི་དེ་ཡི་ཚེ། །སྡིག་པའི་ལས་ལ་རྗེས་འཇུག་པའི། །ས་བདག་རྣམས་ནི་འདུལ་བར་འགྱུར། །
en: “You, divine youth, will, at that time, With your all-reaching words of Mañjuśrī, Guide the kings Who perpetrate evil acts. {53.149}

source: ཁྱོད་ནི་རྫུ་འཕྲུལ་བསམ་མི་ཁྱབ། །གདུལ་བྱ་དག་ཀྱང་བསམ་མི་ཁྱབ། །
en: “The range of your miraculous powers is inconceivable, And the number of those you will guide is inconceivable too.

source: འབྱུང་པོའི་ཚོགས་རྣམས་མ་ལུས་པ། །ཁྱོད་ནི་འདུལ་བྱེད་ཉིད་དུ་འགྱུར། །
en: You will become the guide For all the classes of beings.” {53.150}

source: སངས་རྒྱས་དཔའ་བོས་དེ་གསུངས་ནས། །འོད་ཆེན་ལྡན་པ་འཇམ་དབྱངས་ལ། །གནས་གཙང་སྟེང་བཞུགས་དེ་ཚེ་གཟིགས། །
en: So spoke the great hero to Mañjughoṣa, The great light of the buddhas, Who, at that time, was staying Above the realm of the Pure Abode.

source: རྐང་གཉིས་དམ་པ་རྫོགས་སངས་རྒྱས། །སྨྲ་བའི་མཆོག་གིས་དེ་ལ་གསུངས། །
en: The best of speakers, the perfect buddha, Supreme among two-legged beings, addressed [Mañjughoṣa again]: {53.151}

source: བསྐལ་པ་མང་པོ་འདས་པ་ན། །ཁྱོད་ནི་རྫོགས་སངས་རྒྱས་པར་འགྱུར། །གྲངས་ཀྱིས་མཉམ་མེད་བསམ་མི་ཁྱབ། །མི་ཡིས་གྲངས་དང་མཉམ་མེད་པར། །འཇམ་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བ། །སངས་རྒྱས་འཇིག་རྟེན་འབྱུང་བར་འགྱུར། །
en: “After taking, over many eons, Innumerable human births, Too many to be counted or conceived of, You will be the perfect buddha, Mañjudhvaja by name, In the human world. {53.152}

source: རྟག་ཏུ་ཡང་ནི་མཐར་གྱིས་ཀྱང་། །སངས་རྒྱས་མཛད་པ་དེ་ཚེ་བྱེད། །སེམས་ཅན་མང་པོ་རྣམ་བཀྲོལ་ནས། །མྱ་ངན་འདས་པ་ཉིད་དུ་འགྱུར། །
en: “Then, having performed the acts of a buddha In the correct order as always occurs, And having liberated many beings, You will enter final nirvāṇa.” {53.153}

source: གཞོན་ནུའི་གཟུགས་ཅན་རྫུ་འཕྲུལ་ཆེ། །གཞོན་ནུ་ལ་ནི་དེ་གསུངས་ནས། །བརྩེ་བས་བརླན་པའི་སེམས་ཀྱིས་ནི། །ཡུན་རིང་དབུགས་ཕྱུང་རྣམ་པར་སྐྱོ། །
en: Thus addressed, the divine youth of great power, With the form of a young boy, Let out a long sigh, Awestruck and overcome with compassion. {53.154}

source: ཡུན་རིང་རྫོགས་སངས་རྒྱས་བལྟས་ནས། །མཆི་མའི་ཐིགས་པའང་རྣམ་འཛག་ཅིང་། །ཐལ་མོ་སྦྱར་དང་བཅས་ནས་ནི། །དེ་ནས་ཀྱང་ནི་འདུག་པར་གྱུར། །
en: Shedding tears, He looked at the Buddha for a long time. Then, with his hands folded in salutation, He sat down again. {53.155}

source: དེ་ནས་དེ་ནི་ས་གནས་པ། །མི་ཡི་དམ་པ་མ་སྐྱེས་དགྲས། །རྨད་བྱུང་འོད་སྲུང་ཆེན་པོ་ནི། །བྲམ་ཟེ་ལ་ནི་མགོས་བཏུད་ནས། །
en: “On the earth down below, The emperor Ajātaśatru Will bow his head to the brahmin, The wonderful Mahākāśyapa. {53.156}

source: དྲན་པ་རྙེད་ཅིང་སེམས་སད་ནས། །རྐང་གཉིས་སྐྱིལ་ཀྲུང་བཅས་ནས་འདུག །
en: “Now awake and back to his senses, He will bow down to [Mahākāśyapa’s] feet

source: དེ་ནས་ཡུན་རིང་དབུགས་ཕྱུང་ལ། །དོན་ནི་རྒྱ་ཆེར་ངེས་བསྟན་བྱས། །
en: And, letting out a long sigh, Will announce his aim in full. {53.157}

source: དབང་ཕྱུག་ཆེན་པོ་མ་སྐྱེས་དགྲ། །རྒྱལ་པོའི་བུ་ནི་འདུག་པར་གྱུར། །དེ་ནས་འོད་སྲུང་ཆེས་སྨྲས་པ། །ང་ནི་སྤུར་སྦྱོང་གནས་སུ་འགྲོ། །
en: “Taking his seat, the son of the late king, The great lord, Ajātaśatru by name, Will then say to Mahākāśyapa, ‘Let us go to the place of cremation,

source: མི་རྣམས་ལ་ནི་ཕན་ཕྱིར་དང་། །མཆོད་རྟེན་གཟུགས་གནས་མཆོད་དོན་དུའོ། །
en: Where people worthy of help Worship the one interred under the caitya dome.’ {53.158}

source: ཉན་ཐོས་མཆོག་ནི་གནས་དེ་རུ། །རྫུ་འཕྲུལ་ཉིད་ཀྱིས་ཉེ་བར་ལྷགས། །དེ་དང་འབྲེལ་བར་སེམས་སྐྱེ་བ། །
en: “The eminent śrāvaka, endowed with many powers, Will however remain in the same place And explain his intentions [to Ajātaśatru]:

source: བདག་གི་རྫུ་འཕྲུལ་རིགས་པ་མིན། །
en: ‘It is not proper for me to use my magical power;

source: མཆོད་རྟེན་ཆེན་པོ་མཐོང་བར་ནི། །རྐང་གཉིས་བདག་ནི་འགྲོ་བར་འཚལ། །
en: I would like to proceed To that great funerary gathering on foot.’ {53.159}

source: དེ་ནས་ལམ་གྱི་བར་འདུག་ནས། །འཁོར་བའི་སྟེགས་ནི་རབ་ཏུ་བསྟན། །
en: “He will then set out to see the Teacher In his final journey.

source: ཇི་ཙམ་དེ་ནས་འོངས་གྱུར་པ། །དགེ་འདུན་ཀུན་དགའ་རར་གནས་པའི། །དགེ་སློང་རྒན་ཞུགས་གསར་བུ་ནི། །སྡིག་པ་ཉིད་ཀྱིས་རྣམ་རྨོངས་པས། །
en: On the way, the vow holder [Mahākāśyapa] Will stop at the monastery that is midway, {53.160} “So that he can look up The monastery’s occupants, Particularly, a newly ordained elderly monk Who is sinful and deluded. {53.161}

source: མཐོང་ནས་རྒན་ཞུགས་རྣམས་འཁྲུགས་ཏེ། །གང་ཕྱིར་དེ་དང་ཉེ་བར་འོངས། །གྲགས་པ་ཆེ་ཞིང་སྐལ་བ་ཆེ། །སེམས་ཅན་དག་པ་རིམས་ནད་མེད། །བྲམ་ཟེ་དེ་ཡི་དྲུང་ལྷགས་ནས། །དེ་ཚེ་རྐང་གཉིས་ཕྱག་བྱས་ནས། །དེ་ལ་སྨྲས་པ་སྐལ་བ་ཆེ། །
en: “Seeing the approaching figure, The elderly monk will come forward To meet this most illustrious brahmin, Who fasted for a long time, pure and free from illness. {53.162} “Having approached, He will bow to his feet And say to the illustrious guest,

source: ལེགས་འོངས་ཁྱོད་ནི་ཅི་ཕྱིར་བྱོན། །
en: ‘Welcome! What brings you here? {53.163} “ ‘Or where are you going?

source: མྱུར་དུ་ཁྱོད་ནི་གང་དུ་འགྲོ། །ཡིད་བྱུང་ཅི་ཕྱིར་རབ་ཏུ་འདུག །
en: Are you leaving soon, or are you going to stay?’

source: དེ་སྨྲས་ཁྲོ་ལྡན་བྱིས་པ་ལ། །ཚེ་ལྡན་ཁྱོད་ཀྱིས་མ་ཐོས་སམ། །
en: He will say that to the sage [Mahākāśyapa], Who will reply to the fool, ‘Long-lived one! Have you not heard? {53.164}

source: རྐང་གཉིས་དམ་པ་རྫོགས་སངས་རྒྱས། །འཇིག་རྟེན་ཀུན་གྱི་སྟོན་པ་ནི། །སངས་རྒྱས་བདག་གི་ཕ་ཞེས་སྨྲ། །མར་མེ་འབར་བཞིན་མྱ་ངན་འདས། །
en: “ ‘The Teacher of the whole world, The perfect Buddha, supreme among two-legged beings, My father, a buddha of great wisdom, Is extinguished like the flame of a lamp. {53.165}

source: དཔའ་བོ་ཆེན་པོ་ནུབ་པར་གྱུར། །ས་ཡི་སྟེང་ནི་སྟོངས་པར་གྱུར། །
en: “ ‘The great hero has departed, And the earth has become empty.

source: དེ་བཞིན་འཇིག་རྟེན་མ་ལུས་སྟོངས། །བདག་གི་ཕྱོགས་རྣམས་ཀུན་སྟོངས་གྱུར། །
en: All the worlds are likewise empty, And empty too are the regions for me.’ {53.166}

source: བྱིས་དེ་ཕྱིན་ཅི་ལོག་སེམས་ཀྱིས། །དེར་ནི་རྒན་ཞུགས་རབ་དགའ་ནས། །
en: “Thereupon, the elderly monk With the twisted mind of a fool will rejoice.

source: རབ་རྒོད་ཚིག་ཏུ་སྨྲས་པ་ནི། །རབ་ཏུ་རིང་དེ་འདས་གྱུར་ཏམ། །ཕྱག་རིང་ལུས་ནི་ཆེ་བ་དང་། །མགོ་ནི་གདུགས་ཀྱི་རྣམ་པ་འདྲ། །
en: Laughing in ridicule, he will say, ‘Is that old geezer dead? {53.167} “ ‘The one with long arms And the head lofty as a parasol?

source: བདག་ཅག་རྣམས་ཀྱི་གཙོ་བོ་མཆོག །བསླབ་དང་བསླབ་མིན་རྗེས་སུ་སྟོན། །ད་ལྟར་དེ་ནི་མྱ་ངན་འདས། །ཅི་འདོད་བཞིན་དུ་བདག་ཅག་སྤྱོད། །
en: Our chief guide Steeped in his ‘learned’ ignorance? {53.168} “ ‘Now that he is gone, I will promptly do whatever I want.’

source: རྒན་ཞུགས་ཀྱིས་ནི་དེ་སྨྲས་ནས། །རྫུ་འཕྲུལ་ཆེན་པོ་རབ་འཁྲུགས་ནས། །གདོང་ལ་ཁྲོ་གཉེར་བྱས་ནས་ནི། །ཡི་གེ་ཧཱུྃ་ནི་རབ་ཏུ་སྦྱར། །
en: Powerful Mahākāśyapa, his hair standing on end, Being thus addressed by the old monk, {53.169} “Will knit his brows in angry contortion And employ the syllable hūṁ.

source: སྡོམ་བརྩོན་བག་ཆགས་བསླང་ནས་ནི། །བྲམ་ཟེ་དེ་མོད་རབ་འཁྲུགས་ནས། །
en: The brahmin, habituated to asceticism, Will be furious at that moment. {53.170}

source: རྐང་པའི་མཐེ་བོས་དེ་མ་ཐག །ས་ཡི་སྟེང་དུ་རབ་བསྣུན་པས། །ས་རྣམས་དང་ནི་རི་རབ་ཀྱང་། །རབ་ཏུ་འགུལ་བར་གྱུར་པ་དང་། །
en: “He will strike the ground, At that moment, with his toe, And the entire earth will sway With a loud thunder coming from the mountains. {53.171}

source: རྒྱ་མཚོ་རྣམས་དང་ཤིང་རྣམས་དང་། །རི་རབ་ཀུན་ཀྱང་འཁྲུགས་པར་གྱུར། །ཀླུ་རྒྱལ་དང་ནི་ལྷ་རྣམས་དང་། །རི་སུལ་ཕུག་ཀྱང་རྣམ་པར་འགྱེལ། །
en: “All the oceans will become agitated, All the trees, mountains, Valleys, and caves will quake, And all the nāga s and deities dwelling there will tremble. {53.172}

source: ཟླ་བ་དང་ནི་ཉི་མ་དང་། །ས་སྟེང་དེ་ཚེ་སྣང་བ་ཉམས། །
en: “The light of the moon and the sun Will disappear on earth at that time.

source: རླུང་ཡང་རྒྱུ་བ་མེད་པར་གནས། །སྐར་མདའ་དག་ཀྱང་ས་ལ་ལྟུང་། །
en: The winds will die down, And meteors will fall. {53.173}

source: དེ་ནས་དེ་ནི་སྔགས་ཞེས་བརྗོད། །ཉན་ཐོས་རྣམས་ཀྱི་རིགས་ལས་བྱུང་། །ཡི་གེ་ཧཱུྃ་དེ་ཡི་གེ་གཅིག །ལས་རྣམས་མ་ལུས་བྱེད་ཅིང་དགེ། །
en: “He, One Syllable with the sound hūṁ, When pronounced like this by the śrāvakas, Is the manifestation of the family And auspiciously accomplishes all activities. {53.174}

source: སྔགས་ཀྱི་རྒྱལ་པོ་བཟླས་ཙམ་གྱིས། །འདི་ནི་བཟླས་པ་ཙམ་གྱིས་བྱེད། །འགྲོ་དང་གནས་པའི་དུག་དང་ནི། །དེ་བཞིན་དགྲ་ཀུན་རེངས་པར་བྱེད། །
en: “Even when he is not fully mastered, This king of mantras, just by being recited, Arrests all weapons and poisons, Whether they be of animate or inanimate origin. {53.175}

source: སེམས་ཅན་གདུག་པ་ཐམས་ཅད་ལ། །བཟླས་པ་ཙམ་གྱིས་རེངས་པར་བྱེད། །རྣམ་པ་སྣ་ཚོགས་ལས་བྱེད་ཅིང་། །ཁྱད་པར་དུ་ཡང་གཞན་ཉིད་བྱེད། །
en: “Through merely being recited, He paralyzes all evil beings And accomplishes other specific activities Of many different types. {53.176}

source: རྒན་ཞུགས་ཚིག་ཀྱལ་རབ་སྨྲས་པ། །དེར་ནི་མི་སྨྲར་མཐུར་བལྟས་འདུག །
en: “The garrulous old monk Will fall silent and remain so thenceforth,

source: དེ་ཡི་རྫུ་འཕྲུལ་ལ་དད་ནས། །དེ་ཡི་མོད་ལ་རྣམ་པར་བཏུལ། །དེ་ཚེ་ཉན་ཐོས་མཆོག་གི་ནི། །གདུང་སྦྱོང་ཤིང་གི་དྲུང་དུ་ཁྱེར། །
en: Humbled by [the display of] magical power And chastised, at that moment, by Mahākāśyapa. {53.177} “He will then be led by this eminent śrāvaka To where the funeral pyre is.

source: རྫུ་འཕྲུལ་ཆེན་པོ་འདོད་ཆགས་བྲལ། །དགེ་སློང་དེ་ནི་རྐང་གིས་སོང་། །
en: The monk Mahākāśyapa, free from desire, Exceedingly powerful, will travel there on foot. {53.178}

source: དེར་སོང་དེས་ནི་ཐུབ་པའི་སྐུ། །ཤིང་ལ་ཡོད་པར་རབ་ཏུ་མཐོང་། །
en: “Having arrived, he will see The Sage ’s body laid upon the funeral pyre,

source: ལྷ་ཡི་ཚོགས་ནི་དུ་མས་ཀྱང་། །མཆོད་པ་ཆེན་པོ་བྱེད་པ་དང་། །
en: And many groups of gods Worshiping it with large offerings. {53.179}

source: གཽ་ཏ་མ་ནི་ཐུབ་པ་ཡི། །སྐུ་ནི་ཤིང་གི་སྟེང་བཞག་མཐོང་། །འོད་སྲུང་ཆེན་པོ་རྨད་བྱུང་བ། །སྐལ་བ་ཆེན་པོ་དེ་མཐོང་ནས། །རྫུ་འཕྲུལ་ཆེན་པོས་དགེ་སློང་རྣམས། །ཐམས་ཅད་སྨྲེ་སྔགས་འདོན་པར་བྱེད། །
en: “He will see the funeral pyre, With the body of the sage Gautama mounted upon it, Provided with the best accoutrements And adorned with all the [required] articles. {53.180} “When they see the wonderful, Illustrious Mahākāśyapa, All the monks, Free from faults and very dignified, {53.181}

source: ལྷ་དང་འབྱུང་པོའི་ཚོགས་ཀུན་ནི། །ཧ་ཧའི་རྣམ་པ་རབ་འདོན་ཅིང་། །དེ་ལྟར་མྱ་ངན་སྐྱེས་པ་ཡི། །ཉམ་ཐག་སྒྲ་ནི་ཤིན་ཏུ་ཆེ། །
en: “And all the hosts of gods and spirits, Will exclaim, ‘Alas, alas!’ They will wail with loud cries, Outpourings of their sorrow. {53.182}

source: རྫུ་འཕྲུལ་ཆེན་པོ་ལྷ་དང་ཀླུ། །དེ་ནས་ཀུན་གྱིས་རབ་བསུ་ནས། །རྐང་གཉིས་མཆོག་ལ་ཕྱག་བྱོས་ཞེས། །སྐལ་བ་ཆེ་ལའང་རབ་ཏུ་སྨྲས། །ལྷ་ཚོགས་མི་དང་བཅས་པ་དང་། །འབྱུང་པོ་ཀུན་གྱི་ཚོགས་དག་དང་། །མི་བདག་དྲང་སྲོང་གནོད་སྦྱིན་དག །ཁྱོད་ལ་སྡོད་ཅིང་གཞོལ་བ་ཡིན། །ཤིང་ལ་མེ་གཏོང་འབད་གྱུར་ཀྱང་། །སྐུ་སྦྱོང་ཤིང་ནི་སྦར་མི་ནུས། །
en: “All the powerful gods and nāga s Will come forward And say to the illustrious one, ‘Pay respects to the supreme among two-legged beings! {53.183} “ ‘All the hosts of gods and all the people Have been waiting for you; The hosts of spirits, The ṛṣis, the yakṣa s, and the human kings All tried to light the funeral pyre But were unable to.’ {53.184}

source: དེ་ནས་དེ་ནི་སྐྱོན་བྲལ་བ། །རྫུ་འཕྲུལ་ཆེན་པོ་སྐལ་བ་ཆེས། །གདུང་སྦྱོང་ཤིང་གི་སྨད་ཆ་ལ། །རྫུ་འཕྲུལ་ཆེན་པོ་དེས་ཕྱག་བྱས། །དེ་བཞིན་གཤེགས་པ་རྗེས་དྲན་ནས། །བསྐོར་བ་དག་ཀྱང་མང་དུ་བྱས། །
en: “The illustrious one, free from faults And endowed with great powers, Will circumambulate [the pyre] many times clockwise. Recollecting the Tathāgata, He will pay his respects At the edge of the pyre with great dignity. {53.185}

source: དེ་ཚེ་ལྕགས་ཀྱི་སྒྲོམ་དྲལ་ནས། །ཞབས་གཉིས་དག་ཀྱང་རྣམ་བརྐྱང་ལ། །
en: “He will break open the iron casket So that the two feet emerge.

source: ཡང་དང་ཡང་དུ་ཞབས་བྱུགས་ནས། །ཞབས་གཉིས་སྤྱི་བོས་ཕྱག་བྱས་ནས། །
en: Bowing his head at the feet [of the Blessed One], He will touch them again and again. {53.186}

source: ཐུབ་མཆོག་མཆོག་གི་ཞབས་གཉིས་ལ། །ལན་མང་དག་ཏུ་རྣམ་པར་བལྟས། །དེས་ནི་ཞབས་གཉིས་ཡང་ཞུགས་ཏེ། །ལྕགས་ཀྱི་སྒྲོམ་ལ་ཡང་དག་གནས། །
en: “Having thus repeatedly looked At the fine feet of the eminent sage, He will again lay them to rest In the iron casket. {53.187}

source: རྫུ་འཕྲུལ་ཆེན་པོ་འདོད་ཆགས་བྲལ། །དེ་ནི་དེ་ནས་ལངས་འདུག་པ། །རྫུ་འཕྲུལ་ཆེན་པོ་འདོད་ཆགས་བྲལ། །དགྲ་བཅོམ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར། །
en: “The powerful one who is free from desire Will then rise up and take his seat Among the powerful arhats, Who are also free from desire. {53.188}
